tutorialsDyM/2DBulldozer/Case1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.1;

vertices
(
    ( -0.00  0.0  0)
    ( 1.00  0.0  0)
    ( 1.00  0.5  0)
    ( -0.00  0.5  0)
    ( -0.00  0.0  1)
    ( 1.00  0.0  1)
    ( 1.00  0.5  1)
    ( -0.00  0.5  1)

);

blocks
(


    hex (0 1 2 3 4 5 6 7) (1 120 1) simpleGrading (1 1 1)

);

edges
(
);

boundary
(


    outlet
    {
		        type wall;

   //  type   cyclic;
   //  neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
        );
    }
    
    inlet
    {
		        type wall;

//type   cyclic;
   //  neighbourPatch outlet;
             faces
        (
            (3 0 4 7)
        );
    }
    
    top
    {
        type wall;
        faces
        (
//            (3 7 6 2)
            (3 7 6 2)
        );
    }
    bottom
    {
        type wall;
        faces
        (
//            (3 7 6 2)
            (0 1 5 4)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
